#pragma once
//-----------------------------------------------------------------------------
// Библиотека расширенных типов данных
//  Внимание: перед тем,как плодить новые типы данных, подумай !!!!
//-----------------------------------------------------------------------------
#include "stdint.h"							//
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------

typedef int64_t  				s64;
typedef int32_t  				s32;
typedef int16_t 				s16;
typedef int8_t					s8;

typedef uint64_t				u64;
typedef uint32_t				u32;
typedef uint16_t				u16;
typedef uint8_t					u8;

typedef float     			f32;
typedef double    			f64;
//-----------------------------------------------------------------------------
typedef struct
{
	uint32_t   len; 		// длина
	void* pnt; 					//	указатель любого типа
} typeBuf;	 					// тип буфер
								//-----------------------------------------------------------------------------

